Repository: dgirard/voice_assistant
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, zh

# appTitle
source: Voice Assistant
de: Sprachassistent
es: Asistente de Voz
fr: Assistant Vocal
it: Assistente Vocale
ja: 音声アシスタント
zh: 语音助手

# ready
source: Ready to listen
de: Bereit zum Zuhören
es: Listo para escuchar
fr: Prêt à vous écouter
it: Pronto ad ascoltare
ja: 聞く準備ができました
zh: 准备听取

# listening
source: I'm listening...
de: Ich höre zu...
es: Te estoy escuchando...
fr: Je vous écoute...
it: Ti sto ascoltando...
ja: 聞いています...
zh: 正在听取...

source: Thinking...
de: Ich denke nach...
es: Pensando...
fr: Je réfléchis...
it: Sto pensando...
ja: 考えています...
zh: 思考中...

source: Speaking...
de: Ich spreche...
es: Hablando...
fr: Je réponds...
it: Sto parlando...
ja: 話しています...
zh: 说话中...

source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
zh: 错误

source: French
de: Französisch
es: Francés
fr: Français
it: Francese
ja: フランス語
zh: 法语

source: English
de: Englisch
es: Inglés
fr: Anglais
it: Inglese
ja: 英語
zh: 英语

source: Japanese
de: Japanisch
es: Japonés
fr: Japonais
it: Giapponese
ja: 日本語
zh: 日语

source: Spanish
de: Spanisch
es: Español
fr: Espagnol
it: Spagnolo
ja: スペイン語
zh: 西班牙语

source: Italian
de: Italienisch
es: Italiano
fr: Italien
it: Italiano
ja: イタリア語
zh: 意大利语

source: German
de: Deutsch
es: Alemán
fr: Allemand
it: Tedesco
ja: ドイツ語
zh: 德语

source: Chinese
de: Chinesisch
es: Chino
fr: Chinois
it: Cinese
ja: 中国語
zh: 中文

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
zh: 设置

source: Test Voice
de: Stimme testen
es: Probar Voz
fr: Tester la voix
it: Testa Voce
ja: 音声テスト
zh: 测试语音

# newConversation
source: New conversation started
de: Neue Unterhaltung gestartet
es: Nueva conversación iniciada
fr: Nouvelle conversation démarrée
it: Nuova conversazione iniziata
ja: 新しい会話を開始しました
zh: 新对话已开始

source: Connection error
de: Verbindungsfehler
es: Error de conexión
fr: Erreur de connexion
it: Errore di connessione
ja: 接続エラー
zh: 连接错误

# pressToStart
source: Press the microphone button to start
de: Drücken Sie die Mikrofon-Taste zum Starten
es: Presiona el botón del micrófono para comenzar
fr: Appuyez sur le bouton microphone pour commencer
it: Premi il pulsante del microfono per iniziare
ja: マイクボタンを押して開始してください
zh: 按下麦克风按钮开始

source: Voice Assistant
de: Sprachassistent
es: Asistente de Voz
fr: Assistant Vocal
it: Assistente Vocale
ja: 音声アシスタント
zh: 语音助手

source: Select Assistant
de: Assistent auswählen
es: Seleccionar Asistente
fr: Sélectionner l'Assistant
it: Seleziona Assistente
ja: アシスタントを選択
zh: 选择助手

source: General Assistant
de: Allgemeiner Assistent
es: Asistente General
fr: Assistant Général
it: Assistente Generale
ja: 汎用アシスタント
zh: 通用助手

source: Specialized Assistants
de: Spezialisierte Assistenten
es: Asistentes Especializados
fr: Assistants Spécialisés
it: Assistenti Specializzati
ja: 専門アシスタント
zh: 专业助手

source: TTS Engine
es: Motor TTS
fr: Moteur TTS
it: Motore TTS
ja: TTS エンジン
zh: TTS引擎

source: Android TTS
zh: 安卓TTS

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
zh: 语言

source: Select Language
de: Sprache auswählen
es: Seleccionar Idioma
fr: Sélectionner la langue
it: Seleziona Lingua
ja: 言語を選択
zh: 选择语言

# communicationError
source: Communication error with assistant
de: Kommunikationsfehler mit dem Assistenten
es: Error de comunicación con el asistente
fr: Erreur de communication avec l'assistant
it: Errore di comunicazione con l'assistente
ja: アシスタントとの通信エラー
zh: 与助手通信错误

source: Loading assistants...
de: Assistenten werden geladen...
es: Cargando asistentes...
fr: Chargement des assistants...
it: Caricamento assistenti...
ja: アシスタントを読み込んでいます...
zh: 加载助手中...

# noAssistants
source: No assistants available
de: Keine Assistenten verfügbar
es: No hay asistentes disponibles
fr: Aucun assistant disponible
it: Nessun assistente disponibile
ja: 利用可能なアシスタントがありません
zh: 没有可用的助手

# geminiError
source: Error with Gemini
de: Fehler mit Gemini
es: Error con Gemini
fr: Erreur avec Gemini
it: Errore con Gemini
ja: Gemini エラー
zh: Gemini错误

# raiseError
source: Error with Raise
de: Fehler mit Raise
es: Error con Raise
fr: Erreur avec Raise
it: Errore con Raise
ja: Raise エラー
zh: Raise错误

source: Network error
de: Netzwerkfehler
es: Error de red
fr: Erreur réseau
it: Errore di rete
ja: ネットワークエラー
zh: 网络错误

source: Configuration error
de: Konfigurationsfehler
es: Error de configuración
fr: Erreur de configuration
it: Errore di configurazione
ja: 設定エラー
zh: 配置错误

source: Test completed
de: Test abgeschlossen
es: Prueba completada
fr: Test terminé
it: Test completato
ja: テスト完了
zh: 测试完成

source: Test failed
de: Test fehlgeschlagen
es: Prueba fallida
fr: Test échoué
it: Test fallito
ja: テスト失敗
zh: 测试失败

# initializingAssistant
source: Initializing voice assistant...
de: Sprachassistent wird initialisiert...
es: Inicializando asistente de voz...
fr: Initialisation de l'assistant vocal...
it: Inizializzazione assistente vocale...
ja: 音声アシスタントを初期化しています...
zh: 正在初始化语音助手...

# readyToSend
source: Message ready to send
de: Nachricht bereit zum Senden
es: Mensaje listo para enviar
fr: Message prêt à envoyer
it: Messaggio pronto per l'invio
ja: メッセージ送信準備完了
zh: 消息准备发送

source: Initializing...
de: Initialisierung...
es: Inicializando...
fr: Initialisation...
it: Inizializzazione...
ja: 初期化中...
zh: 初始化中...

source: Application reset
de: Anwendung zurückgesetzt
es: Aplicación reiniciada
fr: Application réinitialisée
it: Applicazione reimpostata
ja: アプリケーションがリセットされました
zh: 应用程序已重置

source: Configuration
de: Konfiguration
es: Configuración
it: Configurazione
ja: 設定
zh: 配置

# customizeExperience
source: Customize your voice assistant experience
de: Passen Sie Ihre Sprachassistent-Erfahrung an
es: Personaliza tu experiencia de asistente de voz
fr: Personnalisez votre expérience d'assistant vocal
it: Personalizza la tua esperienza di assistente vocale
ja: 音声アシスタントの体験をカスタマイズ
zh: 定制您的语音助手体验

# androidTtsActivated
source: Android TTS engine activated
de: Android TTS-Engine aktiviert
es: Motor Android TTS activado
fr: Moteur Android TTS activé
it: Motore Android TTS attivato
ja: Android TTSエンジンがアクティブになりました
zh: Android TTS引擎已激活

# geminiTtsActivated
source: Gemini AI engine activated
de: Gemini AI-Engine aktiviert
es: Motor Gemini AI activado
fr: Moteur Gemini AI activé
it: Motore Gemini AI attivato
ja: Gemini AIエンジンがアクティブになりました
zh: Gemini AI引擎已激活

# ttsTest
source: Text-to-speech test
de: Text-zu-Sprache-Test
es: Prueba de síntesis de voz
fr: Test de synthèse vocale
it: Test di sintesi vocale
ja: 音声合成テスト
zh: 文字转语音测试

# testVoiceQuality
source: Test the quality of the selected engine's voice.
de: Testen Sie die Qualität der Stimme der ausgewählten Engine.
es: Prueba la calidad de la voz del motor seleccionado.
fr: Testez la qualité de la voix du moteur sélectionné.
it: Testa la qualità della voce del motore selezionato.
ja: 選択したエンジンの音声品質をテストします。
zh: 测试所选引擎的语音质量。

source: Test in progress...
de: Test läuft...
es: Prueba en progreso...
fr: Test en cours...
it: Test in corso...
ja: テスト実行中...
zh: 测试进行中...

# advancedGeminiTest
source: Advanced Gemini TTS test
de: Erweiterte Gemini TTS-Test
es: Prueba avanzada Gemini TTS
fr: Test avancé Gemini TTS
it: Test avanzato Gemini TTS
ja: 高度なGemini TTSテスト
zh: 高级Gemini TTS测试

# testGeminiApiDirectly
source: Test the Gemini TTS API directly with advanced parameters.
de: Testen Sie die Gemini TTS-API direkt mit erweiterten Parametern.
es: Prueba la API Gemini TTS directamente con parámetros avanzados.
fr: Testez directement l'API Gemini TTS avec des paramètres avancés.
it: Testa direttamente l'API Gemini TTS con parametri avanzati.
ja: 高度なパラメータでGemini TTS APIを直接テストします。
zh: 使用高级参数直接测试Gemini TTS API。

source: Open TTS Lab
de: TTS-Labor öffnen
es: Abrir laboratorio TTS
fr: Ouvrir le laboratoire TTS
it: Apri laboratorio TTS
ja: TTSラボを開く
zh: 打开TTS实验室

source: About TTS engines
de: Über TTS-Engines
es: Acerca de los motores TTS
fr: À propos des moteurs TTS
it: Informazioni sui motori TTS
ja: TTSエンジンについて
zh: 关于TTS引擎

# androidTtsDescription
source: Android's built-in engine, fast and reliable.
de: Android's integrierte Engine, schnell und zuverlässig.
es: Motor integrado de Android, rápido y confiable.
fr: Moteur intégré au système Android, rapide et fiable.
it: Motore integrato di Android, veloce e affidabile.
ja: Androidの内蔵エンジン、高速で信頼性があります。
zh: Android内置引擎，快速可靠。

# geminiTtsDescription
source: Generative AI with more natural and expressive voice.
de: Generative KI mit natürlicherer und ausdrucksstärkerer Stimme.
es: IA generativa con voz más natural y expresiva.
fr: IA générative avec voix plus naturelle et expressive.
it: IA generativa con voce più naturale ed espressiva.
ja: より自然で表現豊かな音声を持つ生成AI。
zh: 生成式AI，声音更自然和富有表现力。

# androidTtsTestMessage
source: Hello! You are currently hearing the standard Android TTS voice. This voice is fast and reliable.
de: Hallo! Sie hören derzeit die Standard Android TTS-Stimme. Diese Stimme ist schnell und zuverlässig.
es: ¡Hola! Actualmente estás escuchando la voz estándar Android TTS. Esta voz es rápida y confiable.
fr: Bonjour ! Vous entendez actuellement la voix Android TTS standard. Cette voix est rapide et fiable.
it: Ciao! Stai attualmente sentendo la voce standard Android TTS. Questa voce è veloce e affidabile.
ja: こんにちは！現在、標準のAndroid TTS音声を聞いています。この音声は高速で信頼性があります。
zh: 您好！您现在听到的是标准Android TTS语音。这种语音快速可靠。

# geminiTtsTestMessage
source: Hello! You should hear the Gemini AI voice, more natural and expressive.
de: Hallo! Sie sollten die Gemini AI-Stimme hören, natürlicher und ausdrucksvoller.
es: ¡Hola! Deberías escuchar la voz Gemini AI, más natural y expresiva.
fr: Bonjour ! Vous devriez entendre la voix Gemini AI, plus naturelle et expressive.
it: Ciao! Dovresti sentire la voce Gemini AI, più naturale ed espressiva.
ja: こんにちは！より自然で表現豊かなGemini AI音声を聞いているはずです。
zh: 您好！您应该听到Gemini AI语音，更自然和富有表现力。

# geminiTtsNotOperational
source: Gemini TTS is not yet operational. The app uses Android TTS as replacement.
de: Gemini TTS ist noch nicht einsatzbereit. Die App verwendet Android TTS als Ersatz.
es: Gemini TTS aún no está operativo. La app usa Android TTS como reemplazo.
fr: Gemini TTS n'est pas encore opérationnel. L'app utilise Android TTS en remplacement.
it: Gemini TTS non è ancora operativo. L'app usa Android TTS come sostituto.
ja: Gemini TTSはまだ稼働していません。アプリはAndroid TTSを代替として使用しています。
zh: Gemini TTS尚未运行。应用使用Android TTS作为替代。

# testError
source: Error during test: {error}
de: Fehler während des Tests: {error}
es: Error durante la prueba: {error}
fr: Erreur lors du test : {error}
it: Errore durante il test: {error}
ja: テスト中にエラーが発生しました：{error}
zh: 测试期间出错：{error}

source: Test Gemini TTS
de: Gemini TTS testen
es: Probar Gemini TTS
it: Testa Gemini TTS
ja: Gemini TTSテスト
zh: 测试Gemini TTS

# testTtsWithGemini
source: Test text-to-speech with Gemini AI
de: Testen Sie Text-zu-Sprache mit Gemini AI
es: Prueba la síntesis de voz con IA Gemini
fr: Testez la synthèse vocale avec l'IA Gemini
it: Testa la sintesi vocale con IA Gemini
ja: Gemini AIで音声合成をテスト
zh: 使用Gemini AI测试文字转语音

source: Test configuration
de: Testkonfiguration
es: Configuración de prueba
fr: Configuration du test
it: Configurazione del test
ja: テスト設定
zh: 测试配置

source: Voice:
de: Stimme:
es: Voz:
fr: Voix :
it: Voce:
ja: 音声：
zh: 语音：

source: Kore (Recommended)
de: Kore (Empfohlen)
es: Kore (Recomendada)
fr: Kore (Recommandée)
it: Kore (Consigliata)
ja: Kore（推奨）
zh: Kore（推荐）

source: Text to synthesize:
de: Text zu synthetisieren:
es: Texto a sintetizar:
fr: Texte à synthétiser :
it: Testo da sintetizzare:
ja: 合成するテキスト：
zh: 要合成的文本：

source: Enter text to synthesize...
de: Text zum Synthetisieren eingeben...
es: Ingresa el texto a sintetizar...
fr: Entrez le texte à synthétiser...
it: Inserisci il testo da sintetizzare...
ja: 合成するテキストを入力してください...
zh: 输入要合成的文本...

# defaultTestText
source: Hello! This is a test of Gemini AI text-to-speech. Does the voice sound natural and expressive?
de: Hallo! Dies ist ein Test der Gemini AI Text-zu-Sprache. Klingt die Stimme natürlich und ausdrucksstark?
es: ¡Hola! Esta es una prueba de síntesis de voz Gemini AI. ¿La voz suena natural y expresiva?
fr: Bonjour ! Ceci est un test de la synthèse vocale Gemini AI. La voix semble-t-elle naturelle et expressive ?
it: Ciao! Questo è un test della sintesi vocale Gemini AI. La voce suona naturale ed espressiva?
ja: こんにちは！これはGemini AI音声合成のテストです。音声は自然で表現豊かに聞こえますか？
zh: 您好！这是Gemini AI文字转语音的测试。语音听起来自然和富有表现力吗？

source: Run full test
de: Vollständigen Test ausführen
es: Ejecutar prueba completa
fr: Lancer le test complet
it: Esegui test completo
ja: 完全テストを実行
zh: 运行完整测试

source: API connectivity test
de: API-Konnektivitätstest
es: Prueba de conectividad API
fr: Test de connectivité API
it: Test di connettività API
ja: API接続テスト
zh: API连接测试

source: Test result
de: Testergebnis
es: Resultado de la prueba
fr: Résultat du test
it: Risultato del test
ja: テスト結果
zh: 测试结果

# technicalInfo
source: Technical information
de: Technische Informationen
es: Información técnica
fr: Informations techniques
it: Informazioni tecniche
ja: 技術情報
zh: 技术信息

source: Model
de: Modell
es: Modelo
fr: Modèle
it: Modello
ja: モデル
zh: 模型

source: Audio format
es: Formato de audio
fr: Format audio
it: Formato audio
ja: 音声フォーマット
zh: 音频格式

source: API Key
de: API-Schlüssel
es: Clave API
fr: Clé API
it: Chiave API
ja: APIキー
zh: API密钥

source: Endpoint
de: Endpunkt
es: Punto final
fr: Point de terminaison
ja: エンドポイント
zh: 端点

# cleanTempFiles
source: Clean temporary files
de: Temporäre Dateien löschen
es: Limpiar archivos temporales
fr: Nettoyer les fichiers temporaires
it: Pulisci file temporanei
ja: 一時ファイルを削除
zh: 清理临时文件

# geminiTestSuccess
source: 🎉 Gemini TTS test successful!
de: 🎉 Gemini TTS-Test erfolgreich!
es: 🎉 ¡Prueba Gemini TTS exitosa!
fr: 🎉 Test Gemini TTS réussi !
it: 🎉 Test Gemini TTS riuscito!
ja: 🎉 Gemini TTSテスト成功！
zh: 🎉 Gemini TTS测试成功！

# audioGeneratedLimitedPlayback
source: ⚠️ Audio generated, limited playback (experimental version)
de: ⚠️ Audio generiert, begrenzte Wiedergabe (experimentelle Version)
es: ⚠️ Audio generado, reproducción limitada (versión experimental)
fr: ⚠️ Audio généré, lecture limitée (version expérimentale)
it: ⚠️ Audio generato, riproduzione limitata (versione sperimentale)
ja: ⚠️ 音声が生成されました、再生制限あり（実験版）
zh: ⚠️ 音频已生成，播放受限（实验版本）

# tempFilesDeleted
source: 🧹 Temporary files deleted
de: 🧹 Temporäre Dateien gelöscht
es: 🧹 Archivos temporales eliminados
fr: 🧹 Fichiers temporaires supprimés
it: 🧹 File temporanei eliminati
ja: 🧹 一時ファイルが削除されました
zh: 🧹 临时文件已删除

# cleanupError
source: Error during cleanup: {error}
de: Fehler beim Aufräumen: {error}
es: Error durante la limpieza: {error}
fr: Erreur lors du nettoyage : {error}
it: Errore durante la pulizia: {error}
ja: クリーンアップ中にエラー：{error}
zh: 清理时出错：{error}

source: GENERAL
de: ALLGEMEIN
fr: GÉNÉRAL
it: GENERALE
ja: 一般
zh: 通用

source: SPECIALIZED
de: SPEZIALISIERT
es: ESPECIALIZADO
fr: SPÉCIALISÉ
it: SPECIALIZZATO
ja: 専門
zh: 专业

source: You say:
de: Sie sagen:
es: Dices:
fr: Vous dites :
it: Tu dici:
ja: あなた：
zh: 您说：

source: Assistant:
de: Assistent:
es: Asistente:
it: Assistente:
ja: アシスタント：
zh: 助手：

# assistantThinking
source: The assistant is thinking
de: Der Assistent denkt nach
es: El asistente está pensando
fr: L'assistant réfléchit
it: L'assistente sta pensando
ja: アシスタントが考えています
zh: 助手正在思考

# holdButtonToRecord
source: Hold the button to record your message
de: Halten Sie die Taste gedrückt, um Ihre Nachricht aufzunehmen
es: Mantén presionado el botón para grabar tu mensaje
fr: Maintenez le bouton pour enregistrer votre message
it: Tieni premuto il pulsante per registrare il tuo messaggio
ja: ボタンを長押ししてメッセージを録音
zh: 按住按钮录制您的消息

source: Edit your message
de: Bearbeiten Sie Ihre Nachricht
es: Edita tu mensaje
fr: Éditer votre message
it: Modifica il tuo messaggio
ja: メッセージを編集
zh: 编辑您的消息

source: Type your message...
de: Geben Sie Ihre Nachricht ein...
es: Escribe tu mensaje...
fr: Tapez votre message...
it: Scrivi il tuo messaggio...
ja: メッセージを入力してください...
zh: 输入您的消息...

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
zh: 取消

source: Send
de: Senden
es: Enviar
fr: Envoyer
it: Invia
ja: 送信
zh: 发送

source: Android TTS (Recommended)
de: Android TTS (Empfohlen)
es: Android TTS (Recomendado)
fr: Android TTS (Recommandé)
it: Android TTS (Consigliato)
ja: Android TTS（推奨）
zh: Android TTS（推荐）

# geminiTtsInDevelopment
source: Gemini AI TTS (In development)
de: Gemini AI TTS (In Entwicklung)
es: Gemini AI TTS (En desarrollo)
fr: Gemini AI TTS (En développement)
it: Gemini AI TTS (In sviluppo)
ja: Gemini AI TTS（開発中）
zh: Gemini AI TTS（开发中）

source: BETA
fr: BÊTA
ja: ベータ
zh: 测试版

source: Advantages:
de: Vorteile:
es: Ventajas:
fr: Avantages :
it: Vantaggi:
ja: 利点：
zh: 优势：

source: Considerations:
de: Überlegungen:
es: Consideraciones:
fr: Considérations :
it: Considerazioni:
ja: 考慮事項：
zh: 考虑因素：

source: Live
es: En vivo
ja: ライブ
zh: 直播

source: You
de: Sie
es: Tú
fr: Vous
it: Tu
ja: あなた
zh: 您

# missingApiKey
source: Missing API key. Please check the console for instructions.
de: API-Schlüssel fehlt. Überprüfen Sie die Konsole für Anweisungen.
es: Falta la clave API. Consulta la consola para obtener instrucciones.
fr: Clé API manquante. Veuillez vérifier la console pour les instructions.
it: Chiave API mancante. Controlla la console per le istruzioni.
ja: APIキーが見つかりません。コンソールで指示を確認してください。
zh: 缺少API密钥。请检查控制台获取说明。

# raiseAssistantError
source: Error communicating with the Raise assistant.
de: Fehler bei der Kommunikation mit dem Raise-Assistenten.
es: Error al comunicarse con el asistente Raise.
fr: Erreur lors de la communication avec l'assistant Raise.
it: Errore nella comunicazione con l'assistente Raise.
ja: Raiseアシスタントとの通信エラー。
zh: 与Raise助手通信出错。

# couldNotGenerateResponse
source: Sorry, I couldn't generate a response.
de: Entschuldigung, ich konnte keine Antwort generieren.
es: Lo siento, no pude generar una respuesta.
fr: Désolé, je n'ai pas pu générer une réponse.
it: Spiacente, non sono riuscito a generare una risposta.
ja: 申し訳ございませんが、応答を生成できませんでした。
zh: 抱歉，我无法生成回应。

# aiCommunicationError
source: Error communicating with AI.
de: Fehler bei der Kommunikation mit der KI.
es: Error al comunicarse con la IA.
fr: Erreur lors de la communication avec l'IA.
it: Errore nella comunicazione con l'IA.
ja: AIとの通信エラー。
zh: 与AI通信出错。

source: Request cancelled by user.
de: Anfrage vom Benutzer abgebrochen.
es: Solicitud cancelada por el usuario.
fr: Requête annulée par l'utilisateur.
it: Richiesta annullata dall'utente.
ja: ユーザーによってリクエストがキャンセルされました。
zh: 用户取消了请求。

# responseGenerationError
source: An error occurred while generating the response.
de: Ein Fehler ist bei der Generierung der Antwort aufgetreten.
es: Ocurrió un error al generar la respuesta.
fr: Une erreur s'est produite lors de la génération de la réponse.
it: Si è verificato un errore durante la generazione della risposta.
ja: 応答生成中にエラーが発生しました。
zh: 生成回应时发生错误。

# geminiTtsErrorFallback
source: Gemini TTS encountered an error. Here is the standard Android voice.
de: Gemini TTS ist auf einen Fehler gestoßen. Hier ist die Standard-Android-Stimme.
es: Gemini TTS encontró un error. Aquí está la voz estándar de Android.
fr: Gemini TTS a rencontré une erreur. Voici la voix Android standard.
it: Gemini TTS ha riscontrato un errore. Ecco la voce standard di Android.
ja: Gemini TTSでエラーが発生しました。標準のAndroid音声です。
zh: Gemini TTS遇到错误。这是标准Android语音。

source: Speak
de: Sprechen
es: Hablar
fr: Parler
it: Parla
ja: 話す
zh: 说话

source: Stop
de: Stoppen
es: Parar
fr: Arrêter
it: Ferma
ja: 停止
zh: 停止

# settingsDescription
source: Customize your voice assistant experience
de: Passen Sie Ihre Sprachassistent-Erfahrung an
es: Personaliza tu experiencia de asistente de voz
fr: Personnalisez votre expérience d'assistant vocal
it: Personalizza la tua esperienza di assistente vocale
ja: 音声アシスタントの体験をカスタマイズ
zh: 定制您的语音助手体验

# geminiAiActivated
source: Gemini AI engine activated
de: Gemini AI-Engine aktiviert
es: Motor Gemini AI activado
fr: Moteur Gemini AI activé
it: Motore Gemini AI attivato
ja: Gemini AIエンジンがアクティブになりました
zh: Gemini AI引擎已激活

# ttsTestTitle
source: Text-to-speech test
de: Text-zu-Sprache-Test
es: Prueba de síntesis de voz
fr: Test de synthèse vocale
it: Test di sintesi vocale
ja: 音声合成テスト
zh: 文字转语音测试

# ttsTestDescription
source: Test the quality of the selected engine's voice.
de: Testen Sie die Qualität der Stimme der ausgewählten Engine.
es: Prueba la calidad de la voz del motor seleccionado.
fr: Testez la qualité de la voix du moteur sélectionné.
it: Testa la qualità della voce del motore selezionato.
ja: 選択したエンジンの音声品質をテストします。
zh: 测试所选引擎的语音质量。

source: Advanced Gemini TTS test
de: Erweiterte Gemini TTS-Test
es: Prueba avanzada Gemini TTS
fr: Test avancé Gemini TTS
it: Test avanzato Gemini TTS
ja: 高度なGemini TTSテスト
zh: 高级Gemini TTS测试

# advancedGeminiTtsDescription
source: Test the Gemini TTS API directly with advanced parameters.
de: Testen Sie die Gemini TTS-API direkt mit erweiterten Parametern.
es: Prueba la API Gemini TTS directamente con parámetros avanzados.
fr: Testez directement l'API Gemini TTS avec des paramètres avancés.
it: Testa direttamente l'API Gemini TTS con parametri avanzati.
ja: 高度なパラメータでGemini TTS APIを直接テストします。
zh: 使用高级参数直接测试Gemini TTS API。

# androidTtsSubtitle
source: Android's built-in engine, fast and reliable.
de: Android's integrierte Engine, schnell und zuverlässig.
es: Motor integrado de Android, rápido y confiable.
fr: Moteur intégré au système Android, rapide et fiable.
it: Motore integrato di Android, veloce e affidabile.
ja: Androidの内蔵エンジン、高速で信頼性があります。
zh: Android内置引擎，快速可靠。

# geminiAiTtsSubtitle
source: Generative AI with more natural and expressive voice.
de: Generative KI mit natürlicherer und ausdrucksstärkerer Stimme.
es: IA generativa con voz más natural y expresiva.
fr: IA générative avec voix plus naturelle et expressive.
it: IA generativa con voce più naturale ed espressiva.
ja: より自然で表現豊かな音声を持つ生成AI。
zh: 生成式AI，声音更自然和富有表现力。

source: Choose assistant
de: Assistent wählen
es: Elegir asistente
fr: Choisir un assistant
it: Scegli assistente
ja: アシスタントを選択
zh: 选择助手

# geminiTtsDefaultTestText
source: Hello! This is a test of Gemini AI text-to-speech. Does the voice sound natural and expressive?
de: Hallo! Dies ist ein Test der Gemini AI Text-zu-Sprache. Klingt die Stimme natürlich und ausdrucksstark?
es: ¡Hola! Esta es una prueba de síntesis de voz Gemini AI. ¿La voz suena natural y expresiva?
fr: Bonjour ! Ceci est un test de la synthèse vocale Gemini AI. La voix semble-t-elle naturelle et expressive ?
it: Ciao! Questo è un test della sintesi vocale Gemini AI. La voce suona naturale ed espressiva?
ja: こんにちは！これはGemini AI音声合成のテストです。音声は自然で表現豊かに聞こえますか？
zh: 您好！这是Gemini AI文字转语音的测试。语音听起来自然和富有表现力吗？

# testGeminiTtsDescription
source: Test text-to-speech with Gemini AI
de: Testen Sie Text-zu-Sprache mit Gemini AI
es: Prueba la síntesis de voz con IA Gemini
fr: Testez la synthèse vocale avec l'IA Gemini
it: Testa la sintesi vocale con IA Gemini
ja: Gemini AIで音声合成をテスト
zh: 使用Gemini AI测试文字转语音

source: Launch full test
de: Vollständigen Test ausführen
es: Ejecutar prueba completa
fr: Lancer le test complet
it: Esegui test completo
ja: 完全テストを実行
zh: 运行完整测试

# testSuccessMessage
source: ✅ Test successful! Audio generated successfully.
de: ✅ Test erfolgreich! Audio erfolgreich generiert.
es: ✅ ¡Prueba exitosa! Audio generado con éxito.
fr: ✅ Test réussi ! Audio généré avec succès.
it: ✅ Test riuscito! Audio generato con successo.
ja: ✅ テスト成功！オーディオが正常に生成されました。
zh: ✅ 测试成功！音频生成成功。
