Repository: dgirard/voice_assistant
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, zh

# audioGeneratedButPlaybackFailed
source: ⚠️ Audio generated but playback failed. This is normal - Gemini TTS is experimental.
de: ⚠️ Audio generiert, aber Wiedergabe fehlgeschlagen. Das ist normal - Gemini TTS ist experimentell.
es: ⚠️ Audio generado pero la reproducción falló. Esto es normal - Gemini TTS es experimental.
fr: ⚠️ Audio généré mais lecture échouée. C'est normal - Gemini TTS est expérimental.
it: ⚠️ Audio generato ma riproduzione fallita. È normale - Gemini TTS è sperimentale.
ja: ⚠️ オーディオが生成されましたが再生に失敗しました。これは正常です - Gemini TTSは実験的です。
zh: ⚠️ 音频已生成但播放失败。这是正常的 - Gemini TTS是实验性的。

# geminiTtsTestSuccess
source: 🎉 Gemini TTS test successful!
de: 🎉 Gemini TTS-Test erfolgreich!
es: 🎉 ¡Prueba Gemini TTS exitosa!
fr: 🎉 Test Gemini TTS réussi !
it: 🎉 Test Gemini TTS riuscito!
ja: 🎉 Gemini TTSテスト成功！
zh: 🎉 Gemini TTS测试成功！

source: ⚠️ Test partially successful
de: ⚠️ Test teilweise erfolgreich
es: ⚠️ Prueba parcialmente exitosa
fr: ⚠️ Test partiellement réussi
it: ⚠️ Test parzialmente riuscito
ja: ⚠️ テスト部分的成功
zh: ⚠️ 测试部分成功

source: ❌ Connectivity error
de: ❌ Verbindungsfehler
es: ❌ Error de conectividad
fr: ❌ Erreur de connectivité
it: ❌ Errore di connettività
ja: ❌ 接続エラー
zh: ❌ 连接错误

source: Gemini AI TTS (In development)
de: Gemini AI TTS (In Entwicklung)
es: Gemini AI TTS (En desarrollo)
fr: Gemini AI TTS (En développement)
it: Gemini AI TTS (In sviluppo)
ja: Gemini AI TTS（開発中）
zh: Gemini AI TTS（开发中）

# geminiAiTtsSubtitle2
source: Very natural AI voice - Automatic fallback to Android TTS
de: Sehr natürliche KI-Stimme - Automatischer Rückfall auf Android TTS
es: Voz IA muy natural - Fallback automático a Android TTS
fr: Voix IA très naturelle - Fallback automatique vers Android TTS
it: Voce IA molto naturale - Fallback automatico ad Android TTS
ja: 非常に自然なAI音声 - Android TTSへの自動フォールバック
zh: 非常自然的AI声音 - 自动回退到Android TTS

# androidTtsPros1
source: ✓ No additional cost
de: ✓ Keine zusätzlichen Kosten
es: ✓ Sin costo adicional
fr: ✓ Pas de coût supplémentaire
it: ✓ Nessun costo aggiuntivo
ja: ✓ 追加コストなし
zh: ✓ 无额外成本

# androidTtsPros2
source: ✓ Very low latency
de: ✓ Sehr geringe Latenz
es: ✓ Latencia muy baja
fr: ✓ Latence très faible
it: ✓ Latenza molto bassa
ja: ✓ 非常に低いレイテンシ
zh: ✓ 非常低的延迟

# androidTtsPros3
source: ✓ Works offline
de: ✓ Funktioniert offline
es: ✓ Funciona sin conexión
fr: ✓ Fonctionne hors ligne
it: ✓ Funziona offline
ja: ✓ オフラインで動作
zh: ✓ 支持离线使用

# androidTtsPros4
source: ✓ Optimized system integration
de: ✓ Optimierte Systemintegration
es: ✓ Integración del sistema optimizada
fr: ✓ Intégration système optimisée
it: ✓ Integrazione di sistema ottimizzata
ja: ✓ 最適化されたシステム統合
zh: ✓ 优化的系统集成

# androidTtsCons1
source: • Standard voice quality
de: • Standard-Sprachqualität
es: • Calidad de voz estándar
fr: • Qualité vocale standard
it: • Qualità vocale standard
ja: • 標準的な音声品質
zh: • 标准语音质量

# androidTtsCons2
source: • Less natural voices
de: • Weniger natürliche Stimmen
es: • Voces menos naturales
fr: • Voix moins naturelles
it: • Voci meno naturali
ja: • あまり自然でない音声
zh: • 较不自然的声音

# geminiAiTtsPros1
source: ✓ Very natural voice
de: ✓ Sehr natürliche Stimme
es: ✓ Voz muy natural
fr: ✓ Voix très naturelle
it: ✓ Voce molto naturale
ja: ✓ 非常に自然な音声
zh: ✓ 非常自然的声音

# geminiAiTtsPros2
source: ✓ Expressive intonation
de: ✓ Ausdrucksstarke Intonation
es: ✓ Entonación expresiva
fr: ✓ Intonation expressive
it: ✓ Intonazione espressiva
ja: ✓ 表現豊かなイントネーション
zh: ✓ 富有表现力的语调

# geminiAiTtsPros3
source: ✓ Multiple voice styles
de: ✓ Mehrere Stimmstile
es: ✓ Múltiples estilos de voz
fr: ✓ Styles de voix multiples
it: ✓ Stili di voce multipli
ja: ✓ 複数の音声スタイル
zh: ✓ 多种声音风格

# geminiAiTtsPros4
source: ✓ Generative AI technology
de: ✓ Generative KI-Technologie
es: ✓ Tecnología IA generativa
fr: ✓ Technologie IA générative
it: ✓ Tecnologia IA generativa
ja: ✓ 生成AI技術
zh: ✓ 生成AI技术

# geminiAiTtsCons1
source: • Uses Gemini API quota
de: • Verwendet Gemini API-Kontingent
es: • Usa cuota API Gemini
fr: • Utilise le quota API Gemini
it: • Usa quota API Gemini
ja: • Gemini APIクォータを使用
zh: • 使用Gemini API配额

# geminiAiTtsCons2
source: • Requires internet connection
de: • Erfordert Internetverbindung
es: • Requiere conexión a internet
fr: • Nécessite une connexion internet
it: • Richiede connessione internet
ja: • インターネット接続が必要
zh: • 需要互联网连接

# geminiAiTtsCons3
source: • Experimental version
de: • Experimentelle Version
es: • Versión experimental
fr: • Version expérimentale
it: • Versione sperimentale
ja: • 実験版
zh: • 实验版本

# geminiAiTtsCons4
source: • May have latency
de: • Kann Latenz haben
es: • Puede tener latencia
fr: • Peut avoir de la latence
it: • Può avere latenza
ja: • レイテンシがある可能性
zh: • 可能有延迟

# pressMicrophoneToStart
source: Press the microphone button to start a conversation
de: Drücken Sie die Mikrofon-Taste, um eine Unterhaltung zu beginnen
es: Presiona el botón del micrófono para comenzar una conversación
fr: Appuyez sur le bouton microphone pour commencer une conversation
it: Premi il pulsante del microfono per iniziare una conversazione
ja: マイクボタンを押して会話を開始
zh: 按下麦克风按钮开始对话

# frenchDescription
source: French - Voice recognition and responses in French
de: Französisch - Spracherkennung und Antworten auf Französisch
es: Francés - Reconocimiento de voz y respuestas en francés
fr: Français - Reconnaissance vocale et réponses en français
it: Francese - Riconoscimento vocale e risposte in francese
ja: フランス語 - 音声認識とフランス語での応答
zh: 法语 - 语音识别和法语回复

# noResponseGenerated
source: Sorry, I couldn't generate a response.
de: Entschuldigung, ich konnte keine Antwort generieren.
es: Lo siento, no pude generar una respuesta.
fr: Désolé, je n'ai pas pu générer une réponse.
it: Spiacente, non sono riuscito a generare una risposta.
ja: 申し訳ございませんが、応答を生成できませんでした。
zh: 抱歉，我无法生成回应。

# requestCancelled
source: Request cancelled by user.
de: Anfrage vom Benutzer abgebrochen.
es: Solicitud cancelada por el usuario.
fr: Requête annulée par l'utilisateur.
it: Richiesta annullata dall'utente.
ja: ユーザーによってリクエストがキャンセルされました。
zh: 用户取消了请求。

# frenchSystemResponse
source: Understood! I am your voice assistant. I will respond naturally and conversationally in English. How can I help you?
de: Verstanden! Ich bin Ihr Sprachassistent. Ich werde natürlich und gesprächig auf Deutsch antworten. Wie kann ich Ihnen helfen?
es: ¡Entendido! Soy tu asistente de voz. Responderé de manera natural y conversacional en español. ¿Cómo puedo ayudarte?
fr: Compris ! Je suis votre assistant vocal. Je répondrai de manière naturelle et conversationnelle en français. Comment puis-je vous aider ?
it: Capito! Sono il tuo assistente vocale. Risponderò in modo naturale e conversazionale in italiano. Come posso aiutarti?
ja: 理解しました！私はあなたの音声アシスタントです。日本語で自然で会話的に応答します。どのようにお手伝いできますか？
zh: 明白了！我是您的语音助手。我将用中文自然地进行对话式回复。我可以如何帮助您？
